public class OrderSamokatTestData {
        // Добавляем по два набора параметров для каждой кнопки. Кнопки также делаем параметрами.
    public static Object[][] getOrderData() {
        return new Object[][]{
                {
                        "UP",
                        "Александр",
                        "Гаврилов",
                        "Москва, ул. Ярцевская, 27А",
                        "88005553535",
                        "Молодежная",
                        "25.08.2026",
                        true,
                        "Привезите с полным зарядом"
                },
                {
                        "UP",
                        "Май",
                        "Абрикосов",
                        "Москва, Проспект Мира, 119",
                        "88004567889",
                        "ВДНХ",
                        "11.09.2026",
                        false,
                        "Купите по пути бигтейсти"
                },
                {
                        "DOWN",
                        "Александр",
                        "Гаврилов",
                        "Москва, ул. Ярцевская, 27А",
                        "88005553535",
                        "Молодежная",
                        "25.08.2026",
                        true,
                        "Привезите с полным зарядом"
                },
                {
                        "DOWN",
                        "Май",
                        "Абрикосов",
                        "Москва, Проспект Мира, 119",
                        "88004567889",
                        "ВДНХ",
                        "11.09.2026",
                        false,
                        "Купите по пути бигтейсти"
                }
        };
    }
}